spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/invalid_card/does_not_charge_card_successfully.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[cvc]=314&card[exp_month]=3&card[exp_year]=2017&card[number]=4000000000000002
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.37.0
      Authorization:
      - Bearer sk_test_7JTMJwS4BCTpTlpuPUvy8w9F
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.37.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Rubys-MacBook-Air.local 14.5.0 Darwin Kernel Version 14.5.0: Mon Jan 11 18:48:35
        PST 2016; root:xnu-2782.50.2~1/RELEASE_X86_64 x86_64","hostname":"Rubys-MacBook-Air.local"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Mar 2016 08:16:48 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_89VcKzm6kkXWpI
      Stripe-Version:
      - '2016-03-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_17tCbEFjLkRnZ7kWT1iTtCkL",
          "object": "token",
          "card": {
            "id": "card_17tCbEFjLkRnZ7kWXYiY1XPz",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 3,
            "exp_year": 2017,
            "fingerprint": "kNplshSbFowmCYDn",
            "funding": "credit",
            "last4": "0002",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "59.148.100.76",
          "created": 1458980208,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Sat, 26 Mar 2016 08:16:48 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=300&currency=usd&source=tok_17tCbEFjLkRnZ7kWT1iTtCkL
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.37.0
      Authorization:
      - Bearer sk_test_7JTMJwS4BCTpTlpuPUvy8w9F
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.37.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Rubys-MacBook-Air.local 14.5.0 Darwin Kernel Version 14.5.0: Mon Jan 11 18:48:35
        PST 2016; root:xnu-2782.50.2~1/RELEASE_X86_64 x86_64","hostname":"Rubys-MacBook-Air.local"}'
      Content-Length:
      - '59'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Mar 2016 08:16:49 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_89Vclu2xXU78sl
      Stripe-Version:
      - '2016-03-07'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_17tCbFFjLkRnZ7kWnhpwlXkW"
          }
        }
    http_version: 
  recorded_at: Sat, 26 Mar 2016 08:16:49 GMT
recorded_with: VCR 3.0.1
